# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# •	Пилешко меню –  10.35 лв.
# •	Меню с риба – 12.40 лв.
# •	Вегетарианско меню  – 8.15 лв.
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
# •	Брой пилешки менюта – цяло число в интервала [0 … 99]
# •	Брой менюта с риба – цяло число в интервала [0 … 99]
# •	Брой вегетариански менюта – цяло число в интервала [0 … 99]
# Изход
# Да се отпечата на конзолата един ред:  "{цена на поръчката}"

chicken_menu = int(input())
fish_menu = int(input())
vegan_menu = int(input())
su = ((chicken_menu*10.35) + (fish_menu*12.40) + (vegan_menu*8.15))
desert = (su*0.2)
total_sum = (su + desert + 2.50)

print(f"{total_sum}")
